{   
    "page" : {
        "title" : "Vanshil Shah",
        "links" : 
        [  
            {
                "title": "About me",
                "value": "../index.html"
            },
            {
                "title": "Blogs",
                "value": "./all.html"
            }
        ]
    },
    "blogs" : [
    {
        "name" : "all",
        "image": "images/peru.jpg",
        "date" : "",
        "sections" : [
            {"type" : "text", "value" : "Hi, my name is Vanshil, I am an incoming Software Engineer at Google and a recent graduate from University of Toronto. I have started these blogs as a medium to share career advice and travel guides. Check out my most recent blog post!"}
        ]
    },
    {
        "name" : "How I landed jobs at Google, Facebook and Uber: Advice to students in software",
        "image": "images/ask.png",
        "date" : "May 28th, 2019",
		"sections" : [
            {"type" : "text", "value" : "I often get questions from younger students, about steps I took to land high-profile, competitive internships, and a full-time job at Google. Firstly, I applaud any student who takes the time to look ahead, and takes the initiative to reach out. These are my three pieces of advice to incoming university first years in software:"},
            {"type" : "header", "value" : "1. Get work experience early."},
            {"type" : "text", "value" : "This means get started <b>today</b> on finding a summer job after first year, and try to get a part-time job during the school year. I worked part-time during first year for 10 hours a week doing Android development and while it is not necessary, getting experience early sets you up to dominate the job market later on. Working part-time can also be a great way to get your foot in the door, in my case, I was able to work at the same company after first year for a summer internship. For the bigger companies, your chances of getting an interview after 1st year are very low, and only possible after 2nd year if you have work experience. If you are in a co-op program or your school happens to be a <i>\"target school\"</i> for these companies, you will have better chances in securing an offer after 2nd year (I'm looking at you Waterloo students). Landing an interview as a 3rd year student is the most likely as companies are looking to convert summer interns into full-time employees after graduation. Everyone follows a different trajectory and there is no clearly marked path to these companies. Luck is also a major factor and as such, do not be discouraged if you get rejected the first <i>X</i> times. Until then, aim to get early experience in your reach, and build up your skills so you can ace the interview when the opportunity comes. The latter is an art form of its own and worthy of a seperate post about my learnings in this matter."},
            {"type" : "header", "value" : "2. Build projects on the side and follow your heart."},
            {"type" : "text", "value" : "Side projects look good on resumes, but they are also valuable because you build skills you do not learn in school. I have been working on side projects since high school and can not credit them enough. Not many people look at them this way but in my opinion they serve as opportunities to talk about your learnings with fellow programmers. To share a quick anecdotal example of this, I met the person who got me an interview at <b>Uber</b> when he looked to my screen and asked me about what I was working on. A good side project to get started with is building a personal website: you can build basic skills, learn to debug, and have a digital business card you can direct people towards to learn more about you. I began working on <b>vanshil.com</b> in 12th grade and have been regularly iterating it over the years. It has become so much a part of me that rather than needing to bring it up near the end of a conversation, it now precedes me and I often meet people who have seen my website before even meeting me."},
            {"type" : "text", "value" : "The <b><i>follow your heart</i></b> part of this point is to tell you it is ok to prioritize work that motivates you and maximizes your learning. When you get started in university, it is easy to become overwhelmed with the change and chase grades as you did in high school. While good grades can <i>potentially</i> help you secure an interview, average grades will not drag you down if you have built an impressive resume outside of school. The only exceptions to this are work opportunities that come from a school related career portal. However, if you are in software you will quickly learn that there are more (and probably better) opportunities outside of this gated community. This is <b>not an excuse</b> to fail school, my grades were far from failing when I was in school, but only to help you realize the lack of impact your GPA has on your career. I have only been asked about my GPA <b>once at a career fair</b> in my four years of going to career fairs and submitting job applications. Keep in mind however, if you are interested in any type of higher education beyond an undergrad, your GPA does matter and there is nothing wrong with making that a priority."},
            {"type" : "header", "value" : "3. Seek help."},
            {"type" : "text", "value" : "Reach out to older students and those who inspire you. The other two points in this post are advice commonly found online, but I see a minority of younger students following this last point. In my opinion it is probably the most important. My career path would not be the same if I had not made an impression on older students whom I met at hackathons or personally contacted. They were the people who referred me to big companies, answered all of my questions, vetted my resumes, and helped me prep for the interviews. Having heard many other people's stories, I now know that almost nobody makes it on their own. You need to be giving your 100% <b>and</b> seek help from those above you. I have never been turned down from asking for advice and have always left these encounters with more knowledge. On the flip side, everyone loves sharing advice and I have never felt it a chore to help those who reach out to me. When approached the right way and with respect for the other individual’s time, you have nothing to lose and everything to gain by seeking guidance. You are going to meet a lot of new people in the next few months so take the time to ask yourself, \"What can I learn from this individual?\" Over time you will amass enough knowledge that you can pay it forward to the generation that follows you."}
            
        ]
    },
    {
        "name" : "3 ways to stand out at a career fair: Advice to students in software",
        "image": "images/impala.jpg",
        "date" : "May 30th, 2019",
		"sections" : [
            {"type" : "text", "value" : "We have all been there. Standing in a 10 person line for the Amazon booth at a campus career fair. You get to the front of the line in hopes of striking a conversation with the recruiter and praying that they ask for your resume and put it in the <b><i>\"potential candidates\"</b></i> pile instead of the <b><i>\"soon to be trashed\"</b></i> one (if you did not know they did this, well now you know). Career fairs can be a gold mine when it comes to personal development, yet to many they can feel like a minefield. Having attended many myself I have learned what it means to be successful at a career fair, and the steps you should take to get there."},
            {"type" : "header", "value" : "1. Present yourself"},
            {"type" : "text", "value" : "Standing out from the crowd is critical to your success at a career fair, how you present yourself is a very large part of this. You should obviously dress business casual and look presentable, but <b>presenting yourself extends beyond your attire and grooming</b>. You must adjust how you carry yourself, what you are physically carrying and the persona you reflect. Whenever possible, carry only a binder or clipboard for your resume, and a paper and pen to write stuff down. Carrying very little makes you look and feel more open and this will reflect in the way you communicate with others. The pen and paper are valuable when you need to quickly jot something down without losing the conversational momentum. Keeping your resume in your hand makes it easier for you or the recruiter to lead the conversation towards the end goal; the recruiter taking a look at your resume. Your resume stands as the ultimate presentation of yourself and it should be worth introducing into the conversation. In other words, if you are bringing up your resume, it should leave the recruiter with a better representation of you than the conversation you had with them. In order to stand out, a very bizarre yet effective trick I often use is to print my resume on higher quality paper. Using a premium paper can subconsciously affect how people look at your resume and the value they attach to it. You should still keep regular prints handy and only hand the high quality ones to companies that you feel will respect the additional effort. A good rule of thumb is, use the premium if you are handing the resume to a person, as it will be worth the reaction (believe me, they will have a reaction)."},
            {"type" : "header", "value" : "2. Talk to people and seek growth"},
            {"type" : "text", "value" : "In my opinion, your one and only goal at a career fair should be to make other people remember you. Take some time to talk to the smaller companies attending, if you can, talk to <b>every</b> company attending. Chances are, the representatives will be nicer to you, more likely to listen and provide you with an opportunity. This is not a commentary on how selective you should be for your own career, but a reminder that career fairs are for personal development. There is no harm in learning about companies in your industry, even if they do not end up being a place where you are interested in working. Having general awareness of your industry will help you converse better with those in it. Small companies also serve as great conversation practice where you can practice how to talk about yourself and your experience. It is natural to feel shy, especially when placed in a large open space where everyone else seems to be more interesting than yourself. The only way to overcome this shyness and become your most presentable self is to engage in conversations."},
            {"type" : "text", "value" : "Career fairs are a <b>goldmine</b> for self development. Every career fair you attend will provide learnings that you can take home and improve upon. Want to know what the other candidates are doing right? You can observe them in action at a career fair. Have you ever wondered what recruiters notice first about your resume? You can observe their reactions at a career fair! In fact, I have had interactions with recruiters during which I have explicitly asked them to critique my resume. Not once have I been denied this request, and there is nothing to lose in this situation. Additionally, it requires them to take a closer look at your resume and perhaps notice something they earlier had not."},
            {"type" : "header", "value" : "3. Ask the right questions"},
            {"type" : "text", "value" : "We have established that conversations are important in career fairs, but what should you talk about? Everybody asks questions at career fairs so you should only ask the questions that matter and that make you stand out. My favourite question to ask tech companies (usually more relevant for smaller companies) is: <b><i>\"What technologies do you guys work with\".</b></i> Any recruiter will know to list the frameworks and languages that they are looking for and this helps you better understand how to advertise yourself. If you are lucky enough to be speaking with someone technically inclined, you can respond to their answer with: <b><i>\"Oh, you work with ‘X’ technology? I recently used that for a project I built that does ‘Y’.</b></i>  This simple pattern initiates an engaging conversation, while subtly advertising your skills as a programmer. For larger tech companies, they will generally have work with all sorts of frameworks so the same pattern might not fare as well. Instead when you get to the front of the line it is worth getting straight to the point. Introduce yourself, explain what type of position you are looking for, and your experience up until this point. Next you can ask the recruiter what their company is looking for, and <b>if</b> you fit their needs it is as simple as handing them your resume and pointing out where you meet the criteria. Usually the recruiter will highlight those relevant areas and hold onto the resume. Realistically, I have only ever seen students who exactly fit their criteria move forward from a career fair at a large tech company. In many cases it is not worth your time to approach these companies at a career fair, and they will likely tell you to apply online anyways."},
            {"type" : "text", "value" : "Ultimately your measure of success at a career fair should not only be the impressions you left on people, but also those that they left on you. When you approach these events as a learning opportunity your success is assured."},
            {"type" : "text", "value" : "<b>Share this post with someone you believe would learn from this!</b>"}
            
        ]
    }
]}
