{   
    "page" : {
        "title" : "Vanshil Shah",
        "links" : 
        [  
            {
                "title": "About me",
                "value": "../index.html"
            },
            {
                "title": "Blogs",
                "value": "./all.html"
            }
        ]
    },
    "blogs" : [
    {
        "name" : "all",
        "image": "images/costa_rica.jpg",
        "date" : "",
        "sections" : [
            {"type" : "text", "value" : "Hi, my name is Vanshil, I'm a Software Engineer at Google and a recent graduate from University of Toronto. I've started these blogs as a medium to share career advice and travel guides. Check out my most recent blog post!"}
        ]
    },
    {
        "name" : "Nobody is reading your resume, here is why",
        "image" : "images/resume.jpg",
        "date" : "May 8th, 2021",
        "sections" : [
            {"type" : "text", "value" : "Every now and then I review resumes for students, or friends who reach out to me. Usually, this takes me a lot of time because I like to focus on the details and point out every area of improvement I see. Conversely, recruiters will spend mere seconds looking at your resume. Your resume is an extreme elevator pitch meant to sell yourself to employers. Even in 2021, resume's are the most common medium for demonstrating work experience. A good resume can open career opportunities. If you have content on your resume that you haven't updated in years, this is your sign to refresh your resume."},
            {"type" : "header", "value" : "What you need to understand."},
            {"type" : "text", "value" : "<strong>Content is key.</strong> When I say you need to refresh your resume, I'm not referring to the visual appeal. Yes, the aesthetic is important, but the visual aspect will almost never be the reason you get hired. It isn't the reason nobody's reading your resume."},
            {"type" : "text-list", "value": [
                "Nobody's reading your resume because it's boring.&nbsp;",
                "Nobody's reading your resume because they don't know what to read first.&nbsp;",
                "Nobody's reading your resume because it's too complicated.&nbsp;"
                ]},
            {"type" : "header", "value" : "Stop sounding fancy"},
            {"type" : "text", "value" : "The purpose of your resume is to convey information about you. Trying to sound fancy just gets in the way."},
            {"type" : "text", "value" : "In the modern world, your resume targets two audiences. Humans and computers. Each one, extracts different information from your resume. Aim to <strong>maximize comprehension</strong> for both."},
            {"type" : "header2", "value" : "Humans"},
            {"type" : "text", "value" : "To a recruiter, the content on your resume, is going to make or break their impression of you. If you take away one thing from this blog post.<strong> Communication skills are the most important skills in any professional position</strong>. I have one <strong>golden rule</strong> for every line on my resume."},
            {"type" : "text", "value" : "<strong>If a recruiter only reads this one sentence on my resume:</strong>"},
            {"type" : "text-list", "value": [
                    "<strong>1. Will they understand it?</strong>",
                    "If a sentence is too long, or too complicated, it's useless.&nbsp;",
                    "<strong>2. Will they extract a positive impression of me?</strong>",
                    "It's not good enough to have content that leaves a neutral impression."
                ]},
            {"type" : "text", "value" : "So how do you make sure every sentence passes this test?"},
            {"type" : "text", "value" : "Well there's no one-size-fits-all answer for the <strong>right</strong> way to do this. But there are definitely mistakes that are the <strong>wrong</strong> way to word content on your resume."},
            {"type" : "text", "value" : "<strong>Multiple clauses in the same sentence</strong>. You want simple sentences. Simple sentences are understandable. Sentences that go on forever end up getting re-read. Time spent re-reading the same sentence is time taken away from reading the rest of your resume. My rule of thumb here is try and stick to one line for each bullet point."},
            {"type" : "text", "value" : "<strong>Complicated words</strong>. I've done it too, I've added complicated words to a simple point to make it sound more fancy. I see this often in students' resumes because its the same trick most students use on essays to meet word counts. &nbsp;The reason this is a losing strategy on your resume is because it distracts from the key information. The real world values direct and simple communication. Salespeople don't wear snobby outfits and try to convince you they're better than you. They get to your level and try to give you as much information as they can. The goal is to maximize throughput of information and minimize resistance in comprehension. Large fancy words, interfere with comprehension."},
            {"type" : "header2", "value" : "Computers"},
            {"type" : "text", "value" : "If you're applying online, many companies will process your resume using an AI. In most cases, the AI is scanning for key-words to discern how well you match the job posting. Key-words or buzz-words, are words that are relevant to your field. It might be names of coding languages, computer software and tools or even rival companies' names. You can bet that Pepsi is looking for applicants with <i>\"Coca-Cola\"</i> on their resume."},
            {"type" : "text", "value" : "To perform well here, you want to include as many key words in your resume without being repetitive. Its unlikely the AI is counting how many times a keyword shows up, so don't overdo it. You can also use online tools to see how well your resume matches a specific job posting."},
            {"type" : "text", "value" : "Additionally, in order for a computer to parse your resume, the text needs to be in a parseable format. Weird formatting or special symbols can cause difficulties here. You can check this simply by highlighting the text in the PDF and pasting it into a new document. Unless asked for a specific format, use PDFs. Its 2021, people open resumes on phones, iPads, Macs, PCs, maybe even their smartwatch. PDFs are the standard."},
            {"type" : "header", "value" : "Focus on relevant information"},
            {"type" : "text", "value" : "Your resume is a demonstration of your communication skills. &nbsp;Very often I see resumes that are two pages long, or have information crammed up the margins of the page. This pattern just shows the reader:"},
            {"type" : "text-list", "value" : [
                "1. You're too lazy to focus your resume to the specific role.",
                "2. You lack the ability to highlight relevant information."
                ]},
            {"type" : "text", "value" : "Remember, it's on <strong>you</strong> to convince the recruiter you're suitable for the job. It's not their responsibility to find the relevant parts. Going back to the golden rule. Every line on your resume should highlight your qualities and experience. You only have a few shots at making an impression to the reader."},
            {"type" : "header", "value" : "Presentation Order"},
            {"type" : "text", "value" : "Another common criticism I have with resumes is the presentation-order for information. The information at the top of your resume should be more important than that below it. The ideal order of information depends on your level of experience, personal strengths, and the position you're applying for. The best I can do is give some guidance based on career progression."},
            {"type" : "header2", "value" : "Highschool student/graduate"},
            {"type" : "text", "value" : "At this level, your extracurricular experience is probably your biggest strength. I'd focus on the clubs or volunteer roles most relevant to the job posting. If you have any relevant awards, or achievements I would highlight those as well. Perhaps you held a summer job in retail, or as a camp counsellor. Although valuable, experience like this isn't usually relevant to skilled jobs. I would say, keep this on your resume, but don't lead with it, <strong>unless </strong>you're applying to a similar role."},
            {"type" : "header2", "value" : "University Student"},
            {"type" : "text", "value" : "You're at the very beginning of your career. As you progress through school you're gaining an education relevant to your field.&nbsp;"},
            {"type" : "text", "value" : "I often see university students dump their course codes and names onto their resumes. Brilliant right? What a concise way to communicate how smart you are! Honestly, the only value to putting your courses on your resume is being able to include buzz words. Putting course codes on your resume isn't impressive, everyone is doing it, and its very boring to read.&nbsp;"},
            {"type" : "text", "value" : "Instead, apply your favourite learnings into side projects. Then, write about those projects on your resume. This is a recipe for success because not only are you reinforcing your learning. You're actually demonstrating a very important quality. <strong>Passion</strong>. Take a good look at the peers in your program who're getting hired by the best companies. I can almost guarantee they all demonstrate passion for their careers."},
            {"type" : "header2", "value" : "Working Professional"},
            {"type" : "text", "value" : "This one is pretty simple, focus on your work experience. Assuming you're applying to similar roles, your work experience should speak for itself. The key word here is <strong>focus,</strong> which means, remove focus from irrelevant information. One trick I use, is to play around with font sizes, bolding, and placement of text. Move things around so that the first word someone would read on your resume is the most important.&nbsp;"},
            {"type" : "header", "value" : "The Truth"},
            {"type" : "text", "value" : "When it comes to highly sought-after jobs at large companies. Wether you're in finance, tech, or any industry. <strong>The most impactful word on your resume will be the name of a competitor under your work experience.</strong>&nbsp;"},
            {"type" : "text", "value" : "Let's say you've achieved this major milestone in your career but you're looking for a switch. At this point, is there any value, in perfecting your resume?&nbsp;"},
            {"type" : "text", "value" : "From a <em>\"getting an interview\"</em> perspective, probably not.&nbsp;"},
            {"type" : "text", "value" : "But your resume is actually passed around a lot more than you think. It's used when they make a hire/no hire decision. It's used to assess the type of compensation they'll offer you. It's even used to decide which sort of team you might join. So even though you no longer need a stellar resume to land an interview. A well-written resume can still provide tons of value throughout the hiring process.&nbsp;"},
            {"type" : "header", "value" : "What are you waiting for?"},
            {"type" : "text", "value" : "There's no perfect way to write a resume. In fact, a lot of my personal preferences bias this very blog post. But there's definitely one truth when it comes to resumes. As you progress throughout your career, you resume needs to adapt. The focus needs to shift. The irrelevant information needs to go<strong>. </strong>It needs to be readable! Writing a good resume is as important as the efforts you make afterwards. What's the point of applying to 100 jobs with a resume you spent 30 minutes writing? Or even worse, a resume you wrote 3 years ago?&nbsp;"},
            {"type" : "text", "value" : "Writing a resume isn't a one time thing, it'll always take attention and improvement over time. So get started today, but also don't forget to keep improving!"}
        ]
    },
    {
        "name" : "How to ace an internship: Habits of successful interns",
        "image": "images/success.jpg",
        "date" : "July 26th, 2020",
        "sections" : [
                {"type" : "text", "value" : "You did it! You landed an internship at your dream company. Now you have 4 months to excel and secure a return offer.&nbsp;"},
                {"type" : "text", "value" : "Internships are awesome learning experiences. Over the course of 4 months, you get to work alongside full time employees and learn the tricks of the trade. At the same time, you want to ensure you perform up to expectations and land a return offer. Here are my 7 steps on making a positive impression and acing your internship."},
                {"type" : "header", "value" : "1. Planning"},
                {"type" : "text", "value" : "Human intelligence is quite unique. We have a natural ability to plan many steps ahead. As we expand our knowledge and skills, our brains chunk together the trivial parts. Over time, we develop the ability to complete more complex tasks.&nbsp;"},
                {"type" : "text", "value" : "Consider the beginner artist who sketches and erases lines many times. Finally after a lot of trial and error, he gets the shape he wanted and moves on to the next line. An expert artist could draw the same shape brilliantly in his first go. How can we emulate the expert without having achieved that skill level? Well, how do you get a toddler to accurately draw an elephant with only straight lines? Connect the dots!&nbsp;"},
                {"type" : "text", "value" : "A detailed plan is like laying out the dots in a connect-the-dots drawing. Sadly, the beginner will still struggle to even place the dots. Which is why as an intern, coming up with a plan is only Step 1. You'll want to get feedback from your team members <strong>before moving forward.</strong> Once you have an end-to-end plan with clear milestones. It'll be a lot easier and time efficient to work through those milestones."},
                {"type" : "text", "value" : "If you're going to commit time to some work, better to make sure you're not wasting it. You can even build this habit for projects outside of work. You'll get a lot more done, and save time."},
                {"type" : "text", "value" : "Good planning also results in good artifacts. An artifact is a document, screenshot, tracker, or anything that summarizes your work. Artifacts help you showcase your work, and help your manager evaluate your performance. Not to mention, artifacts are easy ways to build visibility."},
                {"type" : "header", "value" : "2. Practice visibility"},
                {"type" : "text", "value" : "Improving your <em>visibility</em> as an intern will have a huge impact on securing a return offer. Visibility is about showing your work to people who don't work with you directly. People like your manager's manager, and members on teams you interact with. As an intern, your destiny is usually fated on the visibility of your work. How can your manager, and his manager make a case to hire you back if they aren't aware of what you did? Some easy ways to improve your visibility are:"},
                {"type" : "text-list", "value": [
                  " - Sharing design plans.",
                  " - Sharing progress with your team.",
                  " - Contributing to meetings.",
                  " - Asking questions.",
                  " - Taking initiative on team-level improvements."
                ]},
                {"type" : "text", "value" : "A good trick I did throughout my internships was to share a weekly <em><strong>intern update</strong></em> via email to my greater team.&nbsp;"},
                {"type" : "text", "value" : "Each update contained the following information:"},
                {"type" : "text-list", "value": [
                  " - Things I got done",
                  " - Things I learned",
                  " - Things I'm still stuck on"
                ]},
                {"type" : "text", "value" : "This differed from a progress update because of the latter two sections. By sharing what I learned, and what I was stuck on, I opened up a new avenue for communication. I would end up getting advice from people I didn't interact with about how to get unstuck. Sometimes if I shared an interesting artifact, it would get shared around, and I'd get feedback on it."},
                {"type" : "text", "value" : "If you're nervous about sharing your work, remember. Everyone loves to see an intern doing something productive for the company."},
                {"type" : "header", "value" : "3. Be prepared for meetings with questions"},
                {"type" : "text", "value" : "The purpose of a meeting is to share knowledge, or explore solutions. As an intern, majority of the time you'll be on the receiving end of knowledge transfer. Being prepared for a meeting makes all the difference in its productivity. Keep the meeting on track with an agenda and have a defined set of questions you need answered. Preparing a set of questions makes sure that you leave the meeting with the value you wanted. Meetings are like a window for other people to see the way you work. Productive meetings leave an impression. You'll develop a reputation as someone who gets things done. Even if you haven't been the most productive."},
                {"type" : "header", "value" : "4. Accept the fact that you're learning."},
                {"type" : "text", "value" : "An intern needs to walk a fine line to showcase they're independent, without wasting time. Independence is about solving problems on your own with little hand-holding. Being over-independent results in wasted time getting stuck on trivial problems.&nbsp;"},
                {"type" : "text", "value" : "A good rule of thumb is, if you make 0 progress after 30 minutes of focused work on a task, it can be helpful to ask around. If however, you're making slow but steady progress, it might be best to keep pushing along. You can always ask your manager about how well of a balance you're keeping."},
                {"type" : "text", "value" : "Another thing to consider is, what is the expected return on asking for help? If you ask a team member for help, what are you expecting they will do? Sometimes by thinking this way, you can unblock yourself by following the same steps. Or you can ask them to teach you that process. It's like the analogy of &nbsp;\"receiving a fish\" vs. \"learning how to fish\". If you know when you ask person X for help, they're going to refer to some document and troubleshoot your problem. Ask them to teach you that process rather than asking them to solve your problem. Like this you'll start relying on documentation and debugging, building yourself towards independence.&nbsp;"},
                {"type" : "header", "value" : "5. Take initiative."},
                {"type" : "text", "value" : "Almost wherever you work, there will be something that inconveniences your team. Or there will be some low-hanging fruit that can improve your team's experience. Either way, taking initiative in these areas will always prove beneficial.&nbsp;"},
                {"type" : "text", "value" : "At one of my internships I followed the internal process to get our team a TV. We used the TV to display a dashboard of key metrics. This was a ridiculously easy task that required a couple of emails and minor logistics. My manager, and his manager, touted for weeks about how helpful the dashboard was."},
                {"type" : "text", "value" : "At another company, I made improvements to my team's code review tool. Once again, it was a small initiative that made my team members' workday more convenient."},
                {"type" : "text", "value" : "Always ask yourself, what pain points do my team members and I face? Some of these pain points will inevitably be too complicated to commit time fixing. But every so often, there will be a diamond in the rough that's worth detracting time from your job. If you're ever unsure, you can always write a plan beforehand and gauge buy-in from your team."},
                {"type" : "text", "value" : "See if there are ways to automate repetitive tasks. If there are productivity hacks you've made for yourself, share them with your team. Continuous initiative exceeds expectations for an intern, and makes you memorable."},
                {"type" : "header", "value" : "6. Be a stress reducer, not a stress creator"},
                {"type" : "text", "value" : "<b><em>\"Anybody who reduces my stress becomes invaluable to me, I never want to get rid of them.\" - Mark Cuban</em></b>"},
                {"type" : "text", "value" : "Want to win over your manager and teammates? The best way to do so, is to reduce their stress. In your meetings, are you creating more problems, or solving their problems?&nbsp;"},
                {"type" : "text", "value" : "Always communicate what you&rsquo;re doing, why you&rsquo;re doing it and when it'll get done. Constant communication is the key to staying on track and meeting expectations. Showcase your communication skills and make yourself invaluable to your team."},
                {"type" : "header", "value" : "7. Collect actionable feedback&nbsp;"},
                {"type" : "text", "value" : "At the end of the day an internship is all about building skills for a career. The best thing you can do is gain direct feedback from your peers and manager. In some internship programs, there will be a structured way for you to get this feedback. For example, performance reviews. If your internship doesn't have such a process, its on you to get the feedback. Valuable feedback will be project specific, and actionable. You'll want feedback on job relevant dimensions such as:"},
                {"type" : "text-list", "value": [
                  " - Learning speed/Ramp up time",
                  " - Quality of work",
                  " - Communication",
                  " - Leadership/Initiative",
                  " - Delivering on deadlines",
                  " - Anything else that you feel is relevant to your job"
                ]},
                {"type" : "text", "value" : "If your company's process doesn't cover these topics, send out a questionnaire to your team. Make sure you get the feedback you need to improve for your next internship. Effective employees are always improving, and have an open ear to feedback."},
                {"type" : "text", "value" : "Throughout the course of your internship, make a habit to ask your manager for feedback. It's always good to know your manager's expectations throughout the internship. You can ask them questions like:&nbsp;"},
                {"type" : "text", "value" : "<b><em>\"Did you feel like the time I took to complete task X was reasonable?\"</em></b>"},
                {"type" : "text", "value" : "<b><em>\"I made some mistakes for project Y, how can I improve and prevent those mistakes in the future?\"</em></b>"},
                {"type" : "text", "value" : "Open communication goes a long way, and prevents any surprises at the end of your internship."},
                {"type" : "text", "value" : "Internships can be stressful, but they're also significant learning opportunities. When you focus on self-improvement during an internship, <strong>success will chase you.</strong>"}
        ]
    },
    {
        "name": "Coding Interviews Unravelled",
        "image": "images/interview.jpg",
        "date": "December 10th, 2019",
        "sections": [
            {"type" : "text", "value" : "When people reach out to me, the message I get most often is:"},
            {"type" : "text", "value" : "<b><i>\"Hey, I have an interview with XYZ Company next week, any advice for coding interviews?\"</i></b>"},
            {"type" : "text", "value" : "My answer is almost always, <b><i>\"I'll mock interview you.\"</i></b>"},
            {"type" : "text", "value" : "I've been conducting quite a few mock coding interviews over the past few months. It's time to share the feedback I've found myself repeating to each interviewee."},
            {"type" : "header", "value" : "An Anecdote"},
            {"type" : "text", "value" : "On February 1st 2017, I received an email:"},
            {"type" : "text", "value" : "<b><i>\"Hey this is Uber, we saw your resume and we'd like to interview you two weeks from now!\"</i></b> I had just gotten home from my first ever technical interview for a startup in Toronto. They'd asked me to find duplicate elements in a list and I wasn't able to produce the solution. The interviewer literally had to tell me to <b><i>\"use a hash map to complete the process in O(n) time\"</i></b>. I had two weeks to prepare for the biggest opportunity in my career. What followed was a set of decisions and actions that resulted in me landing my first job in Silicon Valley."},
            {"type" : "header", "value" : "Preparation"},
            {"type" : "text", "value" : "You have two weeks to prepare for the biggest interview of your career! What do you do? You need to yield the most output from your time in the coming days. You need to be cutthroat with inefficiencies and optimize your learnings. In all areas of preparation, remember:"},
            {"type" : "text", "value" : "<a href=\"https://science.ubc.ca/students/blog/how-to-increase-your-productivity-by-doing-less\"> 80% of the results come from 20% of the efforts.</a>"},
            {"type" : "text", "value" : "80% of the problems are solved with 20% of the concepts."},
            {"type" : "text", "value" : "80% of the interview score comes from 20% of the time."},
            {"type" : "header2", "value" : "1. Get a copy of \"Cracking the Coding Interview\""},
            {"type" : "text", "value" : "CTCI is the Bible for coding interviews. It's $30 on Amazon, and well worth the investment. Plus, if you actually buy it, you'll feel an obligation to read it!"},
            {"type" : "text", "value" : "Carry this book everywhere you go. Read it on the bus. Read it before you sleep. Read it on the toilet."},
            {"type" : "text", "value" : "I acknowledge its a dense book so here is my list on must read chapters:"},
            {"type" : "text-list", "value": [
                "<b>Introduction</b>",
                "<b>I: The Interview Process</b>",
                "<b>II: Behind the Scenes</b>",
                "- If relevant to your interview",
                "<b>VI: Big O</b>",
                "- Even if you've learnt it in school. Relearn it.",
                "<b>VII: Technical Questions</b>",
                "- This is my favourite chapter, read it twice if you have the time",
                "<b>IX: Data Structures: 1-4, 7-10</b>",
                "- For the chapters here you don't need to go through <b><i>\"Interview Questions\"</i></b> sections. Although, definitely make sure you understand the examples they solve before that section.",
                "<b>XI: Advanced Topics</b>",
                "- If you have fundamentals in CS theory, or have a lot of time, these advance topics can occasionally come clutch. If it feels too dense, skip this chapter, the ROI on your time is not worth it. 80% of problems don't require these concepts."
                ]},
            {"type" : "header2", "value" : "2. Seek mentorship."},
            {"type" : "text", "value" : "Message every person you know who has passed a technical interview at a large tech company. This point is so often overlooked but its value is clear. You get to tap into their learnings without wasting time making the same mistakes. Ask them for an hour of their time (more if you can). Get them to mock interview you and provide feedback."},
            {"type" : "text", "value" : "I did exactly this. I messaged everyone I knew by name who had interned at a respectable company, 5 people in total. Want to know the best part? Not a single one of them turned me down."},
            {"type" : "text", "value" : "People are more willing to give advice than you'd expect."},
            {"type" : "header2", "value" : "3. Focus on problem solving."},
            {"type" : "text", "value" : "One preparation strategy is to learn as many problems as you can find. This technique can work if you can remember \"the trick\" to a bunch of problems. The trick is usually knowing which data structure to use, or which algorithm to apply. This isn't enough. You'll hear all types of stories from your peers about how they <b><i>\"knew the answer, but couldn't code it out\"</i></b>."},
            {"type" : "text", "value" : "In my case, I attempted about 25 Leetcode questions in the two weeks before my interviews. That's 25 questions total between my preparations for Uber, Facebook and Google. This is wildly on the lower end for preparation. Yet, I succeeded because I focused on problem solving and communication. When doing mock interviews, I was improving my communication. I was learning about which thoughts I should share, and which bad ideas I should keep to myself. I built a structured strategy to solving coding problems and followed it to success."},
            {"type" : "text", "value" : "The \"Technical Questions\" chapter in CTCI is a great start to figuring out your own strategy. While practicing problems, look back and think about your approach. Which realizations did you struggle to come across? Which options did you not consider? Which parts of the problem did you struggle to figure out, or struggle to code out?"},
            {"type" : "header2", "value" : "4. Strengthen your communication skills."},
            {"type" : "text", "value" : "Communication is a key skill evaluated during a coding interview. Every line of code written should be explained to the interviewer. The benefits of this are two-fold. Firstly, you ensure the interviewer is following along. Second, you double check yourself. If you say something that doesn't make sense, you've caught yourself making a mistake. Make it a habit to refer back to the inputs of your calculations. This is another technique that improves understanding and forces you to double check. For example:"},
            {"type" : "text", "value" : "<b><i>\"We'll use X and Y here to compute Z. X comes from the previous iteration of the loop and Y is the element we extracted during this iteration.\"</i></b>"},
            {"type" : "text", "value" : "As with training your muscles in the gym, the key to strengthening this skill is isolation."},
            {"type" : "text-list", "value": [
                "- Look back at a simple problem you already know how to solve.",
                "- Attempt to program the solution as if you were explaining your code to an interviewer.",
                "- Note down areas where you struggled to get your thoughts across.",
                "- Repeat until it's perfect.",
                "- Move on to more complex problems."
                ]},
            {"type" : "header2", "value" : "5. Practice using recognizable terms"},
            {"type" : "text", "value" : "The large bulk of concepts and techniques can be boiled down into simpler terms. What do I mean by this? Imagine a problem requires you to use a sliding window to analyze a list. You could communicate this by saying:"},
            {"type" : "text", "value" : "<b><i>\"We’ll use a pointer on the left side of the list and one a few indices later and then we'll move the left one to the right if the element there is odd, and we'll move the right one if the element is even.\"</i></b>"},
            {"type" : "text", "value" : "Notice how this sentence is difficult to read and even harder to comprehend? Instead you could say:"},
            {"type" : "text", "value" : "<b><i>\"We'll be using a sliding window to scan through the list. We will increment the beginning pointer on odd numbers and the end pointer on even numbers\"</i></b>"},
            {"type" : "text", "value" : "The trick is to use standard terms that show your ideas in a recognizable manner. Both sentences describe using a sliding window and incrementing the pointers. Yet, the second one actually mentions the terms. The interviewer will immediately understand your approach and be able to provide feedback or ask further questions. Here is another example:"},
            {"type" : "text", "value" : "Good: <b><i>\"We'll be iterating through the list and on each iteration we will compute X. If Y is greater than Z then we know X to be true for that iteration.\"</i></b>"},
            {"type" : "text", "value" : "Bad: <b><i>\"We'll be going through the list and every time we go through the list we'll check Y and Z and if Z is greater than Y then we'll know that X is true for that time.\"</i></b>"},
            {"type" : "text", "value" : "The first sentence practically reads off as code, the second one is hard to follow."},
            {"type" : "text", "value" : "Most of these terms come straight from chapters and strategies mentioned in CTCI. You can practice communicating these concepts using point 4. This method is great because it sets you up to program the solution with the same building blocks."},
            {"type" : "header2", "value" : "6. Practice templates for different algorithms"},
            {"type" : "text", "value" : "Much like the previous point, this point relies on <b><i>\"chunking\"</i></b>. <a href=\"https://en.wikipedia.org/wiki/Chunking_(psychology)\">Chunking</a> is a psychological strategy our brains use to group together information. We can recall the details of the chunk simply by recalling the name of that specific chunk."},
            {"type" : "text", "value" : "When it comes to algorithms, the fundamental code usually follows a pattern. In fact the underlying pattern is usually how you'll learn the algorithm in class. Why not commit these patterns as templates in your memory? Sticking to a template results in less mistakes and faster coding time."},
            {"type" : "text", "value" : "As an excercise, analyze solutions to 3 problems involving recursion. Try and structure the code so they all follow a similar pattern. The common code between the solutions is the template you should use. The other lines of code are examples of variations you can apply to adapt the template to the problem."},
            {"type" : "text", "value" : "The final benefit will come in your communication. Knowing the algorithm template ensures you use the correct terms when explaining."},
            {"type" : "header2", "value" : "7. Know your interview language."},
            {"type" : "text", "value" : "The programming language you chose for your interview is crucial to your performance. I prefer using Python because of its versatility and concise syntax. Regardless of which language you choose, make sure you're comfortable with it. Make a cheatsheet of trivial procedures and memorize it. You should not need to figure out these things during your interview."},
            {"type" : "text", "value" : "A good example is inserting an element at a specific index within a list. It's very easy to be <b><i>off by one</i></b> while implementing this. You exhibit experience and mastery when you can code these subtasks in your first try. Much like the template advice above, this practice also ensures you make less mistakes during an interview."},
            {"type" : "header2", "value" : "8. Study the theory."},
            {"type" : "text", "value" : "This point is doubling down on reading CTCI. Make sure you're familiar with data structures, algorithms and their time/space complexities. Data structures and algorithms are like tools you can use in your toolbox. Time and space complexities are like the specifications for the tool.  You need to know both because it will impact your decision on using that tool for a given task."},
            {"type" : "text", "value" : "Make sure you know the time complexity of your algorithm. For any potential solution you provide, don’t forget to mention the time complexity. This looks very good on an interview and it forces you to be thoughtful of your decisions. Go in with the assumption that an interviewer is always going to ask you the time complexity. With that in mind try to proactively mention it as you describe solutions. This indicates to the interviewer that you're thinking about the time complexity."},
            {"type" : "text", "value" : "<b><i>I had an instance where an interviewee struggled to decide between two approaches. It wasn't until I asked him the time complexities that he realized, they had the same time complexity.</i></b>"},
            {"type" : "text", "value" : "Thinking proactively simplifies your decisions during an interview. You'll also be more confident you made the right choice."},
            {"type" : "header", "value" : "The Interview"},
            {"type" : "text", "value" : "I mentioned earlier that I have a structured strategy for solving coding problems. A lot of this was initially based off of the strategies outlined in CTCI. I still recommend you check that book out. This structure worked well for me, you should take it and adapt to your strengths."},
            {"type" : "header2", "value" : "1. Repeat the problem to the interviewer in your own words."},
            {"type" : "text", "value" : "The key is to use your own words so that you ensure you understand the problem. Regurgitating the problem as stated doesn't achieve anything. The interviewer will correct your misunderstandings. This is also the part where you confirm behaviour for edge cases and clarify any assumptions you make."},
            {"type" : "header2", "value" : "2. Provide a brute force solution."},
            {"type" : "text", "value" : "Make sure it actually solves the problem and you provide the time complexity. This solution should come very quickly and it will do two things."},
            {"type" : "text-list", "value" : [
                "1. Confirm you understand the problem.",
                "2. Give you a base solution to work off and optimize"
                ]},
            {"type" : "text", "value" : "If your solution doesn't work the interviewer will hint that something is wrong. Interviewers want you to succeed on the interview. Pay attention and catch any hints they sneak in."},
            {"type" : "header2", "value" : "3. Solve the problem as a human."},
            {"type" : "text", "value" : "This is honestly my favourite take-away from CTCI. Our brains adapted for problem solving and we can often replicate our solutions with code. A good example is searching for a page number in a book. Most people will flip to halfway through the book, look at the page number and then repeat in a smaller half until they get close enough to rifle through the pages. This is an occurrence of our brains using binary search without even realizing it. Imagine the problem as if it was a riddle or brain teaser you had to solve. Pay attention to the strategies you develop, the way you hold onto information, and the calculations you make."},
            {"type" : "header2", "value" : "4. Solve some examples."},
            {"type" : "text", "value" : "This goes further with the idea of understanding the problem, and coming up with a human solution. Doing examples helps you understand commonalities between solutions to the problem. Observe how the solution relates to the inputs. Is there more than one solution? Are some solutions easier to calculate than others? These observations will lead to reduced time complexities in your solution."},
            {"type" : "header2", "value" : "5. Go through your tool box of data structures and algorithms."},
            {"type" : "text", "value" : "Think about how the structure of the data affects your solution. Think about how a data structure or algorithm could mitigate inefficiencies. You will likely discover optimizations before you exhaust your options."},
            {"type" : "header2", "value" : "6. Pitch the optimized solution. Don't forget to mention time complexity!"},
            {"type" : "text", "value" : "Most people skip steps 2, 3, 4, jump straight to 5 and try to pitch their best attempt at an optimized solution. This doesn't work because they didn't spend time understanding the problem. They become dissuaded from pitching another solution and spend a lot of time unsure what to do next. If you get here and still need to optimize. Go back and repeat steps 3-5. Remember to use recognizable terms when explaining, and be proactive in mentioning complexities."},
            {"type" : "header2", "value" : "7. Code."},
            {"type" : "text", "value" : "Getting the right answer on step 6 doesn't mean you passed the interview. Getting the wrong answer on step 6 doesn't mean you failed the interview. The next part of the interview is much more important. The simplicity and elegance with which you can do this part will set you apart."},
            {"type" : "text", "value" : "One time during an interview <b>I struggled heavily on optimizing the problem.</b> In fact, I spent 35 minutes coming up with a solution. The interviewer might have even nudged me in the right direction. With 10 minutes left, <b>he'd probably decided to not pass me on that interview.</b> Yet, I managed to code the solution in 5 minutes. The interviewer wanted to make sure my solution worked on some examples. So we ran my code, debugged typos, and had a working solution we tested against for the remaining 5 minutes. <b>I passed that interview.</b>"},
            {"type" : "text", "value" : "Without repeating myself too much, here are the things to remember while coding:"},
            {"type" : "text-list", "value" : [
                "- Explain every line of code. To yourself and the interviewer.",
                "- Remind the interviewer where variables are coming from.",
                "- Utilize your templates",
                "- Listen to the interviewer"
                ]},
            {"type" : "text", "value" : "Your success with coding interviews lies in your own hands. You need to be self critical to identify your weaknesses, and mindful to play to your strengths. I hope this article enables your developlment and helps you accomplish your goals."},
            {"type" : "header2", "value" : "If you found this article helpful please share it with your friends!"}
        ]
    },
    {
        "name" : "3 ways to stand out at a career fair: Advice to students in software",
        "image": "images/impala.jpg",
        "date" : "June 1st, 2019",
		"sections" : [
            {"type" : "text", "value" : "We've all been there. Standing in a 10 person line for the Amazon booth at a campus career fair. You reach the front of the line, try to strike a conversation with the recruiter and pray they place your resume in the <b><b><i>\"potential candidates\"</i></b></b> pile instead of the <b><b><i>\"soon to be trashed\"</i></b></b> one. Career fairs can be a gold mine when it comes to personal development, yet to many people they can feel like a minefield. After attending many myself, I've learned what it means to be successful at a career fair and the steps you should take to stand out."},
            {"type" : "header", "value" : "1. Present yourself"},
            {"type" : "text", "value" : "Standing out from the crowd is critical to your success at a career fair. How you present yourself is a large part of this. You should obviously dress business casual and look presentable, but <b>presenting yourself extends beyond your attire and grooming</b>. You must adjust how you carry yourself, what you're carrying, and the persona you reflect. Whenever possible, carry only a binder or clipboard for your resume, and a paper and pen to write stuff down. Carrying less makes you feel more open and this will reflect in the way you communicate with others. The pen and paper are valuable to jot something down without losing the conversational momentum. Keeping your resume in your hand makes it easier for you or the recruiter to lead the conversation towards the end goal — the recruiter taking a look at your resume."},
            {"type" : "text", "value" : "Your resume stands as the ultimate presentation of your skills and it should be worth introducing into the conversation. If you're bringing up your resume (which you definitely should be doing), it should leave the recruiter with a better representation of you than your conversation with them. There's no point in spending 4 hours at a career fair handing out a resume that you only spent an hour writing. To stand out, a bizarre yet effective trick I often use is to print my resume on higher quality paper. Using premium paper can subconsciously affect how people look at your resume and the value they attach to it. You should still keep regular prints handy and only hand the high-quality ones to companies you feel will appreciate the extra effort. A good rule of thumb is to use the premium paper if you're handing the resume to a person, as it will be worth the reaction (believe me, they will have a reaction). Polishing your resume is <b>worth it</b>, but filling it is more important. The number one issue many undergrads face, is they don’t have enough to write about on their resume. Until you have enough work experience, it’s fair to write in detail about your side projects. Be sure to include technologies you used, features you implemented, and lessons you learned."},
            {"type" : "header", "value" : "2. Talk to people and seek growth"},
            {"type" : "text", "value" : "Your one and only goal at a career fair should be to make other people remember you. Take some time to talk to the smaller companies attending, and if you can, talk to every company attending. The representatives will be nicer to you, listen more attentively, and are more likely to provide you with an opportunity. Remember, career fairs are for personal development. There's no harm in learning about companies in your industry, even if you're not interested in working there. Having this general awareness will help you converse better with those in the same field as you. Small companies also serve as great conversation practice, where you can perfect how to talk about yourself and your experience. It's natural to feel shy at career fairs, you’re in a large open space surrounded by people who seem to be more interesting than you. The only way to overcome this shyness and become your most presentable self is to engage in conversations."},
            {"type" : "text", "value" : "Career fairs are a <b>goldmine</b> for self-development. Every career fair you attend provides learnings you can improve upon."},
            {"type" : "text", "value" : "<b>Want to know what the other candidates are doing right?</b>"},
            {"type" : "text", "value" : "<b><i>You can observe them in action at a career fair.</i></b>"},
            {"type" : "text", "value" : "<b>Have you ever wondered what recruiters notice first when viewing your resume?</b>"},
            {"type" : "text", "value" : "<b><i>You can observe their reactions at a career fair!</i></b>"},
            {"type" : "text", "value" : "Every once in a while, I explicitly ask recruiters to critique my resume at a career fair. There's nothing to lose in this situation. Additionally, it requires them to take a closer look at your resume and perhaps notice something they earlier hadn’t. One of the critical ingredients to becoming an expert in any subject is rapid feedback. There’s no better place than a career fair to collect this feedback on your career-building skills."},
            {"type" : "header", "value" : "3. Ask the right questions"},
            {"type" : "text", "value" : "We've established that conversations are important at career fairs, but what should you talk about? Recruiters are always being asked questions, so focus on asking those that matter, and make you stand out. My favourite question to ask tech companies is: <b><b><i>\"What technologies do you work with?\"</i></b></b> Any recruiter will know to list the frameworks and languages they are looking for and this helps you better understand how to advertise yourself to that company. If you're lucky enough to be speaking with somebody technically inclined, you can respond to their answer with: <b><b><i>\"Oh, you work with X technology? I recently used that for a project I built that does Y. I found it to be very powerful for A, B and C but the learning curve for D was very challenging.\"</i></b></b> This simple pattern initiates an engaging conversation, while subtly advertising your skills as a programmer."},
            {"type" : "text", "value" : "For larger tech companies, they'll generally have work opportunities for all sorts of languages so the same pattern might not fare as well. Instead, when you get to the front of the line, it's worth getting straight to the point. Introduce yourself, explain what type of position you're looking for, and your experience until this point. Next, ask the recruiter what their company is looking for. If you fit their needs, it's as simple as handing them your resume and pointing out where you meet the criteria. Usually, the recruiter will highlight those relevant areas and hold on to the resume. Truthfully, I've only ever seen students who exactly fit the criteria move forward with a large tech company from a career fair. Most times, it's not worth your time to approach these companies at a career fair, and they will likely tell you to apply online anyway."},
            {"type" : "text", "value" : "Your measure of success at a career fair shouldn’t only be the impressions you left on people but also the impressions they left on you. There is a lot to learn from other people in your industry, and when you approach these events as a learning opportunity your success is assured."},
            {"type" : "text", "value" : "<b>Share this post with someone you believe would learn from this!</b>"}
            
        ]
    },
    {
        "name" : "How I landed jobs at Google, Facebook and Uber: Advice to students in software",
        "image": "images/ask.png",
        "date" : "May 28th, 2019",
		"sections" : [
            {"type" : "text", "value" : "I often get questions from younger students, about steps I took to land high-profile, competitive internships, and a full-time job at Google. Firstly, I applaud any student who takes the time to look ahead, and takes the initiative to reach out. These are my three pieces of advice to incoming university first years in software:"},
            {"type" : "header", "value" : "1. Get work experience early."},
            {"type" : "text", "value" : "This means get started <b>today</b> on finding a summer job after first year, and try to get a part-time job during the school year. I worked part-time during first year for 10 hours a week doing Android development and while it's not necessary, getting experience early sets you up to dominate the job market later on. Working part-time can also be a great way to get your foot in the door, in my case, I was able to work at the same company after first year for a summer internship. For the bigger companies, your chances of getting an interview after 1st year are very low, and only possible after 2nd year if you have work experience. If you're in a co-op program or your school happens to be a <b><i>\"target school\"</i></b> for these companies, you'll have better chances in securing an offer after 2nd year <i>(I'm looking at you Waterloo students)</i>. Landing an interview as a 3rd year student is the most likely as companies are looking to convert summer interns into full-time employees after graduation. Everyone follows a different trajectory and there's no clearly marked path to these companies. Luck is also a major factor so don't be discouraged if you get rejected the first <b><i>X</i></b> times. Until then, aim to get early experience in your reach, and build up your skills so you can <a href=\"/blog/coding_interviews_unravelled.html\">ace the interview</a> when the opportunity comes."},
            {"type" : "header", "value" : "2. Build projects on the side and follow your heart."},
            {"type" : "text", "value" : "Side projects look good on resumes, but they're also valuable because you build skills you outside of your curriculum. I've been working on side projects since high school and can't credit them enough. Not many people look at them this way but in my opinion they serve as opportunities to talk about your learnings with fellow programmers. To share a quick anecdotal example of this, I met the person who got me an interview at <b>Uber</b> when he looked to my screen and asked me about what I was working on. A good side project to get started with is building a personal website: you can build basic skills, learn to debug, and have a digital business card you can direct people towards to learn more about you. I began working on <b>vanshil.com</b> in 12th grade and have been regularly iterating it over the years. It's become so much a part of me that rather than needing to bring it up near the end of a conversation, it now precedes me and I often meet people who have seen my website before even meeting me."},
            {"type" : "text", "value" : "The <b><b><i>follow your heart</i></b></b> part of this point is to tell you it's ok to prioritize work that motivates you and maximizes your learning. When you get started in university, it's easy to become overwhelmed with change, and chase grades as you did in high school. While good grades can <b><i>potentially</i></b> help you secure an interview, average grades will not drag you down if you've built an impressive resume outside of school. The only exceptions to this are work opportunities that come from a school related career portal. However, if you're in software you'll quickly learn that there are more (and probably better) opportunities outside of this gated community. This is <b>not an excuse</b> to fail school, my grades were far from failing, but only to help you realize the lack of impact your GPA has on your career. I've only been asked about my GPA <b>once at a career fair</b> in my four years of going to career fairs and submitting job applications. Keep in mind however, if you're interested in any type of higher education beyond an undergrad, your GPA does matter and there's nothing wrong with making that a priority."},
            {"type" : "header", "value" : "3. Seek help."},
            {"type" : "text", "value" : "Reach out to older students and those who inspire you. The other two points in this post are advice commonly found online, but I see a minority of younger students following this last point. In my opinion it's probably the most important. My career path would not be the same if I hadn't made an impression on older students whom I met at hackathons or personally contacted. They were the people who referred me to big companies, answered all of my questions, vetted my resumes, and helped me prep for the interviews. Having heard many other people's stories, I now know that almost nobody makes it on their own. You need to be giving your 100% <b>and</b> seek help from those above you. I've never been turned down from asking for advice and have always left these encounters with more knowledge. On the flip side, everyone loves sharing advice and I've never felt it a chore to help those who reach out to me. When approached the right way and with respect for the other individual’s time, you have nothing to lose and everything to gain by seeking guidance. You're going to meet a lot of new people in the next few months so take the time to ask yourself, \"What can I learn from this individual?\" Over time you'll amass enough knowledge that you can pay it forward to the generation that follows you."}
            
        ]
    }
]}
